#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
random_shuffle.locations: Refreshing state... [id=-]
module.naming.random_string.first_letter: Refreshing state... [id=u]
module.naming.random_string.main: Refreshing state... [id=imyn9hprm5b9x4gakabhdlwygfwy3jfqan9g4d7q2jzj14epdyofp6c68qjm]
data.azurerm_client_config.current: Reading...
azurerm_resource_group.this: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-aifoundr-uimyn]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMjNmNTI3MS04OWMwLTRjNjYtYjZjNS0yYTRkMzUxMjVmYzI7b2JqZWN0SWQ9NWQ0NGM1NjEtYjFkMS00N2QwLThmNGUtNmQzODk5MDNjMjM5O3N1YnNjcmlwdGlvbklkPTg1ZjRjODcxLTA1NzItNDRlNy04MzBlLWRlMzZmYjg3MGEzNzt0ZW5hbnRJZD00MDBlYmI5OS05OWUzLTRhMmEtYWY4My1iMmI1ZWRmZjc0ZmE=]
azurerm_log_analytics_workspace.this: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-aifoundr-uimyn/providers/Microsoft.OperationalInsights/workspaces/log-aifoundr-uimyn]
azapi_resource_action.purge_ai_foundry: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/providers/Microsoft.CognitiveServices/locations/northeurope/resourceGroups/rg-aifoundr-uimyn/deletedAccounts/cog-aifoundr-uimyn]
module.ai_foundry.random_string.resource_token: Refreshing state... [id=853mm]
module.ai_foundry.random_uuid.telemetry[0]: Refreshing state... [id=ecbbff54-e632-d18b-d917-6fed7c0576d2]
module.ai_foundry.module.avm_utl_regions.random_uuid.telemetry[0]: Refreshing state... [id=148ba9a8-d0d9-56a1-07b6-3ae71e068897]
module.ai_foundry.module.cosmosdb["this"].random_uuid.telemetry[0]: Refreshing state... [id=0ae9f18f-a492-5f27-ccb7-863da1787a83]
module.ai_foundry.module.storage_account["this"].random_uuid.telemetry[0]: Refreshing state... [id=cdbf8cc2-2bf8-0f42-9bc0-022970e73fa5]
module.ai_foundry.module.key_vault["this"].random_uuid.telemetry[0]: Refreshing state... [id=141569c3-9122-0ed1-a12f-f7853029ccfd]
module.ai_foundry.modtm_telemetry.telemetry[0]: Refreshing state... [id=e6e4167d-4227-4bd8-be75-c437dbcc078d]
module.ai_foundry.module.storage_account["this"].modtm_telemetry.telemetry[0]: Refreshing state... [id=0bcd740c-8866-4401-8487-931659e65b4a]
module.ai_foundry.module.avm_utl_regions.modtm_telemetry.telemetry[0]: Refreshing state... [id=3ade2114-4282-45db-bec4-6b17827a682d]
module.ai_foundry.module.cosmosdb["this"].modtm_telemetry.telemetry[0]: Refreshing state... [id=cb35b0be-a75f-42c1-8025-f1f2c93fb743]
module.ai_foundry.azapi_resource.ai_search["this"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-aifoundr-uimyn/providers/Microsoft.Search/searchServices/aifoundr-this-ai-foundry-ai-search-853mm]
module.ai_foundry.module.key_vault["this"].azurerm_key_vault.this: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-aifoundr-uimyn/providers/Microsoft.KeyVault/vaults/aifoundr-kv-853mm]
module.ai_foundry.module.storage_account["this"].azurerm_storage_account.this: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-aifoundr-uimyn/providers/Microsoft.Storage/storageAccounts/aifoundrthisfndrysa853mm]
module.ai_foundry.module.key_vault["this"].modtm_telemetry.telemetry[0]: Refreshing state... [id=51b0eb6f-36ff-44b5-82c9-619704bfcfbc]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ai_foundry.module.storage_account["this"].azurerm_storage_account.this has changed
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-aifoundr-uimyn/providers/Microsoft.Storage/storageAccounts/aifoundrthisfndrysa853mm"
        name                               = "aifoundrthisfndrysa853mm"
      + tags                               = {}
        # (97 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # azapi_resource_action.purge_ai_foundry must be replaced
-/+ resource "azapi_resource_action" "purge_ai_foundry" {
      ~ id               = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/providers/Microsoft.CognitiveServices/locations/northeurope/resourceGroups/rg-aifoundr-uimyn/deletedAccounts/cog-aifoundr-uimyn" -> (known after apply)
      + output           = (known after apply)
      ~ resource_id      = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/providers/Microsoft.CognitiveServices/locations/northeurope/resourceGroups/rg-aifoundr-uimyn/deletedAccounts/cog-aifoundr-uimyn" -> "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/providers/Microsoft.CognitiveServices/locations/swedencentral/resourceGroups/rg-aifoundr-uimyn/deletedAccounts/cog-aifoundr-uimyn" # forces replacement
      + sensitive_output = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # azurerm_log_analytics_workspace.this must be replaced
-/+ resource "azurerm_log_analytics_workspace" "this" {
      - cmk_for_query_forced                    = false -> null
      ~ id                                      = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-aifoundr-uimyn/providers/Microsoft.OperationalInsights/workspaces/log-aifoundr-uimyn" -> (known after apply)
      - immediate_data_purge_on_30_days_enabled = false -> null
      ~ local_authentication_disabled           = true -> (known after apply)
      ~ local_authentication_enabled            = false -> (known after apply)
      ~ location                                = "northeurope" -> "swedencentral" # forces replacement
        name                                    = "log-aifoundr-uimyn"
      ~ primary_shared_key                      = (sensitive value)
      ~ secondary_shared_key                    = (sensitive value)
      - tags                                    = {} -> null
      ~ workspace_id                            = "f8f1c028-da25-49f6-8134-76adbc013432" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # azurerm_resource_group.this must be replaced
-/+ resource "azurerm_resource_group" "this" {
      ~ id         = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-aifoundr-uimyn" -> (known after apply)
      ~ location   = "northeurope" -> "swedencentral" # forces replacement
        name       = "rg-aifoundr-uimyn"
      ~ tags       = {
          + "environment" = "dev"
          + "usecase"     = "aifoundr"
        }
        # (1 unchanged attribute hidden)
    }

  # random_shuffle.locations will be destroyed
  # (because random_shuffle.locations is not in configuration)
  - resource "random_shuffle" "locations" {
      - id           = "-" -> null
      - input        = [
          - "northeurope",
          - "westeurope",
        ] -> null
      - result       = [
          - "northeurope",
          - "westeurope",
          - "northeurope",
        ] -> null
      - result_count = 3 -> null
    }

  # module.ai_foundry.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.ai_foundry.azapi_resource.ai_foundry will be created
  + resource "azapi_resource" "ai_foundry" {
      + body                      = {
          + identity   = {
              + type = "SystemAssigned"
            }
          + kind       = "AIServices"
          + properties = {
              + allowProjectManagement = true
              + customSubDomainName    = "cog-aifoundr-uimyn"
              + disableLocalAuth       = false
              + networkAcls            = {
                  + defaultAction       = "Allow"
                  + ipRules             = []
                  + virtualNetworkRules = []
                }
              + networkInjections      = null
              + publicNetworkAccess    = "Enabled"
            }
          + sku        = {
              + name = "S0"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = "swedencentral"
      + name                      = "cog-aifoundr-uimyn"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = false
      + sensitive_body            = (write-only attribute)
      + tags                      = {
          + "environment" = "dev"
          + "usecase"     = "aifoundr"
        }
      + type                      = "Microsoft.CognitiveServices/accounts@2025-04-01-preview"
    }

  # module.ai_foundry.azapi_resource.ai_model_deployment["gpt-4o"] will be created
  + resource "azapi_resource" "ai_model_deployment" {
      + body                      = {
          + properties = {
              + model                = {
                  + format  = "OpenAI"
                  + name    = "gpt-4.1"
                  + version = "2025-04-14"
                }
              + raiPolicyName        = null
              + versionUpgradeOption = "OnceNewDefaultVersionAvailable"
            }
          + sku        = {
              + capacity = 1
              + name     = "GlobalStandard"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + name                      = "gpt-4.1"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.CognitiveServices/accounts/deployments@2025-04-01-preview"
    }

  # module.ai_foundry.azapi_resource.ai_search["this"] must be replaced
-/+ resource "azapi_resource" "ai_search" {
      ~ id                        = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-aifoundr-uimyn/providers/Microsoft.Search/searchServices/aifoundr-this-ai-foundry-ai-search-853mm" -> (known after apply)
      ~ location                  = "northeurope" -> "swedencentral" # forces replacement
        name                      = "aifoundr-this-ai-foundry-ai-search-853mm"
      ~ output                    = {
          - id         = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-aifoundr-uimyn/providers/Microsoft.Search/searchServices/aifoundr-this-ai-foundry-ai-search-853mm"
          - identity   = {
              - principalId = "f1aa6575-b5f3-41c2-8672-3432077ae6cc"
              - tenantId    = "400ebb99-99e3-4a2a-af83-b2b5edff74fa"
            }
          - properties = {
              - encryptionWithCmk = {
                  - encryptionComplianceStatus = "Compliant"
                }
              - provisioningState = "Succeeded"
              - status            = "running"
              - statusDetails     = ""
            }
          - type       = "Microsoft.Search/searchServices"
        } -> (known after apply)
      ~ parent_id                 = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-aifoundr-uimyn" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.ai_foundry.modtm_telemetry.telemetry[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "modtm_telemetry" "telemetry" {
      - id   = "e6e4167d-4227-4bd8-be75-c437dbcc078d" -> null
      - tags = {
          - "location"        = "northeurope"
          - "module_source"   = "registry.terraform.io/Azure/avm-ptn-aiml-ai-foundry/azurerm"
          - "module_version"  = "0.6.0"
          - "random_id"       = "ecbbff54-e632-d18b-d917-6fed7c0576d2"
          - "subscription_id" = "85f4c871-0572-44e7-830e-de36fb870a37"
          - "tenant_id"       = "400ebb99-99e3-4a2a-af83-b2b5edff74fa"
        } -> null
    }

  # module.ai_foundry.random_uuid.telemetry[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "random_uuid" "telemetry" {
      - id     = "ecbbff54-e632-d18b-d917-6fed7c0576d2" -> null
      - result = "ecbbff54-e632-d18b-d917-6fed7c0576d2" -> null
    }

  # module.ai_foundry.module.ai_foundry_project["project_1"].azapi_resource.ai_foundry_project will be created
  + resource "azapi_resource" "ai_foundry_project" {
      + body                      = {
          + identity   = {
              + type = "SystemAssigned"
            }
          + properties = {
              + description = "Markus AI Playground"
              + displayName = "Markus AI Playground"
            }
          + sku        = {
              + name = "S0"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = "swedencentral"
      + name                      = "playground"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + response_export_values    = [
          + "identity.principalId",
          + "properties.internalId",
        ]
      + schema_validation_enabled = false
      + sensitive_body            = (write-only attribute)
      + tags                      = {
          + "environment" = "dev"
          + "usecase"     = "aifoundr"
        }
      + type                      = "Microsoft.CognitiveServices/accounts/projects@2025-04-01-preview"
    }

  # module.ai_foundry.module.ai_foundry_project["project_1"].azapi_resource.connection_cosmos[0] will be created
  + resource "azapi_resource" "connection_cosmos" {
      + body                      = {
          + properties = {
              + authType = "AAD"
              + category = "CosmosDb"
              + metadata = {
                  + ApiType    = "Azure"
                  + ResourceId = (known after apply)
                  + location   = "swedencentral"
                }
              + target   = (known after apply)
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = (known after apply)
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + response_export_values    = [
          + "identity.principalId",
        ]
      + schema_validation_enabled = false
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "Microsoft.CognitiveServices/accounts/projects/connections@2025-04-01-preview"
    }

  # module.ai_foundry.module.ai_foundry_project["project_1"].azapi_resource.connection_search[0] will be created
  + resource "azapi_resource" "connection_search" {
      + body                      = {
          + properties = {
              + authType = "AAD"
              + category = "CognitiveSearch"
              + metadata = {
                  + ApiType    = "Azure"
                  + ApiVersion = "2024-05-01-preview"
                  + ResourceId = (known after apply)
                  + location   = "swedencentral"
                }
              + target   = (known after apply)
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = (known after apply)
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = false
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "Microsoft.CognitiveServices/accounts/projects/connections@2025-04-01-preview"
    }

  # module.ai_foundry.module.ai_foundry_project["project_1"].azapi_resource.connection_storage[0] will be created
  + resource "azapi_resource" "connection_storage" {
      + body                      = {
          + properties = {
              + authType = "AAD"
              + category = "AzureStorageAccount"
              + metadata = {
                  + ApiType    = "Azure"
                  + ResourceId = (known after apply)
                  + location   = "swedencentral"
                }
              + target   = (known after apply)
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = (known after apply)
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + response_export_values    = [
          + "identity.principalId",
        ]
      + schema_validation_enabled = false
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "Microsoft.CognitiveServices/accounts/projects/connections@2025-04-01-preview"
    }

  # module.ai_foundry.module.ai_foundry_project["project_1"].azurerm_role_assignment.ai_search_role_assignments["search_index_data_contributor"] will be created
  + resource "azurerm_role_assignment" "ai_search_role_assignments" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Search Index Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai_foundry.module.ai_foundry_project["project_1"].azurerm_role_assignment.ai_search_role_assignments["search_service_contributor"] will be created
  + resource "azurerm_role_assignment" "ai_search_role_assignments" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Search Service Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai_foundry.module.ai_foundry_project["project_1"].azurerm_role_assignment.cosmosdb_role_assignments["cosmosdb_operator"] will be created
  + resource "azurerm_role_assignment" "cosmosdb_role_assignments" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Cosmos DB Operator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai_foundry.module.ai_foundry_project["project_1"].azurerm_role_assignment.storage_role_assignments["storage_blob_data_contributor"] will be created
  + resource "azurerm_role_assignment" "storage_role_assignments" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai_foundry.module.ai_foundry_project["project_1"].time_sleep.wait_project_identities will be created
  + resource "time_sleep" "wait_project_identities" {
      + create_duration = "10s"
      + id              = (known after apply)
    }

  # module.ai_foundry.module.ai_foundry_project["project_1"].time_sleep.wait_rbac_before_capability_host will be created
  + resource "time_sleep" "wait_rbac_before_capability_host" {
      + create_duration = "60s"
      + id              = (known after apply)
    }

  # module.ai_foundry.module.avm_utl_regions.data.azapi_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azapi_client_config" "current" {
      + id                       = (known after apply)
      + object_id                = (known after apply)
      + subscription_id          = (known after apply)
      + subscription_resource_id = (known after apply)
      + tenant_id                = (known after apply)
    }

  # module.ai_foundry.module.avm_utl_regions.data.azapi_client_config.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azapi_client_config" "telemetry" {
      + id                       = (known after apply)
      + object_id                = (known after apply)
      + subscription_id          = (known after apply)
      + subscription_resource_id = (known after apply)
      + tenant_id                = (known after apply)
    }

  # module.ai_foundry.module.avm_utl_regions.data.modtm_module_source.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "modtm_module_source" "telemetry" {
      + module_path    = ".terraform/modules/ai_foundry.avm_utl_regions"
      + module_source  = (known after apply)
      + module_version = (known after apply)
    }

  # module.ai_foundry.module.avm_utl_regions.modtm_telemetry.telemetry[0] will be updated in-place
  ~ resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
        id               = "3ade2114-4282-45db-bec4-6b17827a682d"
      + nonce            = (known after apply)
      ~ tags             = {
          ~ "module_source"   = "registry.terraform.io/Azure/avm-utl-regions/azurerm" -> (known after apply)
          ~ "module_version"  = "0.5.2" -> (known after apply)
            "random_id"       = "148ba9a8-d0d9-56a1-07b6-3ae71e068897"
          ~ "subscription_id" = "85f4c871-0572-44e7-830e-de36fb870a37" -> (known after apply)
          ~ "tenant_id"       = "400ebb99-99e3-4a2a-af83-b2b5edff74fa" -> (known after apply)
        }
    }

  # module.ai_foundry.module.cosmosdb["this"].azurerm_cosmosdb_account.this will be created
  + resource "azurerm_cosmosdb_account" "this" {
      + access_key_metadata_writes_enabled           = false
      + analytical_storage_enabled                   = true
      + automatic_failover_enabled                   = true
      + burst_capacity_enabled                       = false
      + create_mode                                  = (known after apply)
      + default_identity_type                        = "FirstPartyIdentity"
      + endpoint                                     = (known after apply)
      + free_tier_enabled                            = false
      + id                                           = (known after apply)
      + ip_range_filter                              = [
          + "0.0.0.0",
          + "104.42.195.92",
          + "168.125.123.255",
          + "170.0.0.0/24",
          + "40.76.54.131",
          + "52.169.50.45",
          + "52.176.6.30",
          + "52.187.184.26",
        ]
      + is_virtual_network_filter_enabled            = false
      + kind                                         = "GlobalDocumentDB"
      + local_authentication_disabled                = false
      + location                                     = "swedencentral"
      + minimal_tls_version                          = "Tls12"
      + mongo_server_version                         = (known after apply)
      + multiple_write_locations_enabled             = false
      + name                                         = "aifoundr-this-foundry-cosmosdb-853mm"
      + network_acl_bypass_for_azure_services        = true
      + network_acl_bypass_ids                       = []
      + offer_type                                   = "Standard"
      + partition_merge_enabled                      = false
      + primary_key                                  = (sensitive value)
      + primary_mongodb_connection_string            = (sensitive value)
      + primary_readonly_key                         = (sensitive value)
      + primary_readonly_mongodb_connection_string   = (sensitive value)
      + primary_readonly_sql_connection_string       = (sensitive value)
      + primary_sql_connection_string                = (sensitive value)
      + public_network_access_enabled                = false
      + read_endpoints                               = (known after apply)
      + resource_group_name                          = (known after apply)
      + secondary_key                                = (sensitive value)
      + secondary_mongodb_connection_string          = (sensitive value)
      + secondary_readonly_key                       = (sensitive value)
      + secondary_readonly_mongodb_connection_string = (sensitive value)
      + secondary_readonly_sql_connection_string     = (sensitive value)
      + secondary_sql_connection_string              = (sensitive value)
      + write_endpoints                              = (known after apply)

      + analytical_storage (known after apply)

      + backup {
          + interval_in_minutes = (known after apply)
          + retention_in_hours  = (known after apply)
          + storage_redundancy  = (known after apply)
          + tier                = "Continuous30Days"
          + type                = "Continuous"
        }

      + capabilities (known after apply)

      + capacity {
          + total_throughput_limit = -1
        }

      + consistency_policy {
          + consistency_level = "Session"
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "swedencentral"
          + zone_redundant    = false
        }
      + geo_location {
          + failover_priority = 1
          + id                = (known after apply)
          + location          = "swedensouth"
          + zone_redundant    = false
        }
    }

  # module.ai_foundry.module.cosmosdb["this"].modtm_telemetry.telemetry[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "modtm_telemetry" "telemetry" {
      - id   = "cb35b0be-a75f-42c1-8025-f1f2c93fb743" -> null
      - tags = {
          - "module_source"   = "registry.terraform.io/Azure/avm-res-documentdb-databaseaccount/azurerm"
          - "module_version"  = "0.8.0"
          - "random_id"       = "0ae9f18f-a492-5f27-ccb7-863da1787a83"
          - "subscription_id" = "85f4c871-0572-44e7-830e-de36fb870a37"
          - "tenant_id"       = "400ebb99-99e3-4a2a-af83-b2b5edff74fa"
        } -> null
    }

  # module.ai_foundry.module.cosmosdb["this"].random_uuid.telemetry[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "random_uuid" "telemetry" {
      - id     = "0ae9f18f-a492-5f27-ccb7-863da1787a83" -> null
      - result = "0ae9f18f-a492-5f27-ccb7-863da1787a83" -> null
    }

  # module.ai_foundry.module.key_vault["this"].data.azurerm_client_config.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "telemetry" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.ai_foundry.module.key_vault["this"].data.modtm_module_source.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "modtm_module_source" "telemetry" {
      + module_path    = ".terraform/modules/ai_foundry.key_vault"
      + module_source  = (known after apply)
      + module_version = (known after apply)
    }

  # module.ai_foundry.module.key_vault["this"].azurerm_key_vault.this must be replaced
-/+ resource "azurerm_key_vault" "this" {
      ~ access_policy                   = [] -> (known after apply)
      ~ id                              = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-aifoundr-uimyn/providers/Microsoft.KeyVault/vaults/aifoundr-kv-853mm" -> (known after apply)
      ~ location                        = "northeurope" -> "swedencentral" # forces replacement
        name                            = "aifoundr-kv-853mm"
      ~ rbac_authorization_enabled      = true -> (known after apply)
      ~ resource_group_name             = "rg-aifoundr-uimyn" -> (known after apply) # forces replacement
      - tags                            = {} -> null
      ~ tenant_id                       = "400ebb99-99e3-4a2a-af83-b2b5edff74fa" -> (known after apply)
      ~ vault_uri                       = "https://aifoundr-kv-853mm.vault.azure.net/" -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ contact (known after apply)

      ~ network_acls {
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.ai_foundry.module.key_vault["this"].modtm_telemetry.telemetry[0] will be updated in-place
  ~ resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
        id               = "51b0eb6f-36ff-44b5-82c9-619704bfcfbc"
      + nonce            = (known after apply)
      ~ tags             = {
          ~ "module_source"   = "registry.terraform.io/Azure/avm-res-keyvault-vault/azurerm" -> (known after apply)
          ~ "module_version"  = "0.10.0" -> (known after apply)
            "random_id"       = "141569c3-9122-0ed1-a12f-f7853029ccfd"
          ~ "subscription_id" = "85f4c871-0572-44e7-830e-de36fb870a37" -> (known after apply)
          ~ "tenant_id"       = "400ebb99-99e3-4a2a-af83-b2b5edff74fa" -> (known after apply)
        }
    }

  # module.ai_foundry.module.storage_account["this"].azurerm_storage_account.this must be replaced
-/+ resource "azurerm_storage_account" "this" {
      ~ id                                 = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-aifoundr-uimyn/providers/Microsoft.Storage/storageAccounts/aifoundrthisfndrysa853mm" -> (known after apply)
      ~ large_file_share_enabled           = false -> (known after apply)
      ~ location                           = "northeurope" -> "swedencentral" # forces replacement
        name                               = "aifoundrthisfndrysa853mm"
      ~ primary_access_key                 = (sensitive value)
      ~ primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://aifoundrthisfndrysa853mm.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "aifoundrthisfndrysa853mm.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      ~ primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://aifoundrthisfndrysa853mm.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "aifoundrthisfndrysa853mm.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://aifoundrthisfndrysa853mm.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "aifoundrthisfndrysa853mm.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "northeurope" -> (known after apply)
      ~ primary_queue_endpoint             = "https://aifoundrthisfndrysa853mm.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "aifoundrthisfndrysa853mm.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://aifoundrthisfndrysa853mm.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "aifoundrthisfndrysa853mm.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://aifoundrthisfndrysa853mm.z16.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "aifoundrthisfndrysa853mm.z16.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      ~ resource_group_name                = "rg-aifoundr-uimyn" -> (known after apply) # forces replacement
      ~ secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      - tags                               = {} -> null
        # (22 unchanged attributes hidden)

      ~ blob_properties (known after apply)
      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      ~ network_rules (known after apply)

      ~ queue_properties (known after apply)
      - queue_properties {
          - hour_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      ~ routing (known after apply)

      ~ share_properties (known after apply)
      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }

      ~ static_website (known after apply)
    }

  # module.ai_foundry.module.storage_account["this"].modtm_telemetry.telemetry[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "modtm_telemetry" "telemetry" {
      - id   = "0bcd740c-8866-4401-8487-931659e65b4a" -> null
      - tags = {
          - "location"        = "northeurope"
          - "module_source"   = "registry.terraform.io/Azure/avm-res-storage-storageaccount/azurerm"
          - "module_version"  = "0.6.3"
          - "random_id"       = "cdbf8cc2-2bf8-0f42-9bc0-022970e73fa5"
          - "subscription_id" = "85f4c871-0572-44e7-830e-de36fb870a37"
          - "tenant_id"       = "400ebb99-99e3-4a2a-af83-b2b5edff74fa"
        } -> null
    }

  # module.ai_foundry.module.storage_account["this"].random_uuid.telemetry[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "random_uuid" "telemetry" {
      - id     = "cdbf8cc2-2bf8-0f42-9bc0-022970e73fa5" -> null
      - result = "cdbf8cc2-2bf8-0f42-9bc0-022970e73fa5" -> null
    }

Plan: 19 to add, 2 to change, 13 to destroy.

Warning: Argument is deprecated

  with module.ai_foundry.module.key_vault["this"].azurerm_key_vault.this,
  on .terraform/modules/ai_foundry.key_vault/main.tf line 7, in resource "azurerm_key_vault" "this":
   7:   enable_rbac_authorization       = !var.legacy_access_policies_enabled

This property has been renamed to `rbac_authorization_enabled` and will be
removed in v5.0 of the provider

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @vMarkusK, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*